//ZOWESTOP PROC
//TSO      EXEC PGM=IKJEFT1A
//SYSEXEC    DD DSN=USERXA02.CLIST,DISP=SHR
//SYSTSPRT   DD SYSOUT=*
//SYSTSIN    DD *
 %ZOWESTOP ZWESIS01 ZWESVSTC